What is Open Source?
According to Wikipedia,

Open-source is source code that is made freely available for possible modification and redistribution.

When some source code is made Open source, it includes permission to use, modify, contribute to the existing source code. The use of the term originated with the software but has expanded beyond the software sector to collaboration and contribution.

Open-source projects that are hosted in public repositories benefit from contributions made by the broader developer community and are typically managed through Git.

Now that you have a basic idea about Open Source, we can talk about Hacktoberfest.

What is Hacktoberfest ?
Hacktoberfest is a month-long challenge. It happens every year in the month of October.

Hacktoberfest is open to everyone and it marks the celebration of Open Source. It’s the biggest Open Source event that encourages newbies to participate in Open Source and create their 1st meaningful PR. Hacktoberfest encourages participation in giving back to the open-source community by completing pull requests, participating in events, and donating to open source projects. Also, all backgrounds and skills levels are encouraged to complete the challenge.

Of course, to participate, you must have a GitHub account first. New to GitHub? Check out my GitHub Blog and Playlist to learn more.

Who can Join?
contributors: Anyone around the globe who desires to help drive the growth of open source and make positive contributions to an ever-growing community. All backgrounds and skill levels are encouraged to participate.

maintainers: Anyone that runs an open-source project on GitHub or GitLab and desires help from the community to improve their project can join Hacktoberfest.

companies: Encourage people to contribute to your company’s repositories, organize community events, and engage internal employees.

event organizers: Create events to bring people together for mentorship and code collaborations, so even more people around the world help support open source!

Registration opens on September 28th, wondering how to participate and things you must know before participating, well I will cover that in my next blog.


PERKS:
You get to work with seniors from the community.
Be it your 1st PR or 10th, you will always learn something new.
You get to be a part of the biggest Open Source event.
And of course, the swag kit.
let’s have a look at my swag kit from Hacktoberfest 2020. you get some awesome goodies which include A limited-edition T-shirt for FREE!\ and some stickers.

Got anything to add? mention in the comment box below and I will update the list.

